<?php

$lang = [
    'des_report_title' => '月球攻击',
    'des_report_start' => '您的舰队从 %s %s 抵达了行星 %s %s 的卫星。',
    'des_report_defender' => '防守者未能阻止对卫星的摧毁。',
    'des_result_none' => '卫星的结构没有被充分削弱，舰队正在返回母星。',
    'des_result_moon' => '死星的武器向卫星发射了交替式引力冲击，引发了大规模地震，最终将卫星撕裂。卫星上的所有建筑均被摧毁。大获全胜！<br><br>舰队正在返回母星。<br>',
    'des_result_ds' => '震动开始摇撼卫星表面，但出现了问题，死星的引力子也引发了震动，使得死星爆炸成千万碎片。',
    'des_result_both' => '您的死星将其交替式引力冲击炮对准了卫星。起初，微弱的震动在卫星表面逐渐增强。卫星开始变形并被撕裂。巨大的碎片飞向您的舰队。已经来不及躲避。您的整支舰队在碎片雨中被摧毁。',
    'des_moon_ds_chances' => '卫星摧毁几率: %d %%，死星摧毁几率:%d %%',
];
