<?php

$lang = [
    'of_title' => '军官',
    'of_recruit' => '招募',
    'of_inactive' => '未激活',
    'of_darkmatter_description' => '暗物质是一种只能储存几个标准年的物质，仍然需要大量的努力。它可以被加工以产生难以想象的能量。获取暗物质的方法复杂且充满风险，使其非常珍贵。只有购买的且仍然可用的暗物质才能保护账户免于删除！',
    'of_darkmatter_description_short' => '可以用这种稀有物质雇佣指挥官和军官。',
    'of_get_darkmatter' => '获取暗物质',
    'of_months' => '3个月',
    'of_week' => '1周',
    'of_time_remaining_less' => '还剩 %s 天激活',
    'of_time_remaining_one' => '剩余1天',
    'of_time_remaining_many' => '仍激活超过 %s 天',
    'of_hire_commander' => '雇佣指挥官',
    'of_hire_admiral' => '雇佣上将',
    'of_hire_engineer' => '雇佣工程师',
    'of_hire_geologist' => '雇佣地质学家',
    'of_hire_technocrat' => '雇佣技术官',
    'of_add_premium_officier_commander' => '+40 收藏夹，建筑队列，运输扫描器，无广告',
    'of_add_premium_officier_admiral' => '最大舰队槽位 +2，最大远征 +1，改进舰队逃逸率',
    'of_add_premium_officier_engineer' => '防御损失减半，+10% 能量生产',
    'of_add_premium_officier_geologist' => '+10% 矿场生产',
    'of_add_premium_officier_technocrat' => '+2 间谍等级，研究时间减少25%',
    'officiers' => [
        601 => [
            'name' => '指挥官',
            'description' => '指挥官职位在现代战争中已经确立。由于简化的指挥结构，指令可以更快地处理。有了指挥官，您就能够纵观整个帝国！这允许您开发使您更接近敌人的结构。',
            'benefits' => '+40 收藏夹，建筑队列，运输扫描器，无广告',
        ],
        602 => [
            'name' => '上将',
            'description' => '舰队上将是一位经验丰富的作战老兵和熟练的战略家。即使在最艰难的战斗中，他也能够创建态势概览并与下属上将保持联系。舰队上将也是一位熟练的计算机程序员，在紧急情况下，可以获得两个额外的槽位来控制他的战斗舰队。他还提供一个额外的远征槽位，并允许向舰队传递命令，详细说明在成功攻击后掠夺时应优先考虑哪些资源。',
            'benefits' => '最大舰队槽位 +2，最大远征 +1，改进舰队逃逸率',
        ],
        603 => [
            'name' => '工程师',
            'description' => '工程师是能量管理和防御能力方面的专家。在和平时期，他增加殖民地的能量，确保所有电网的均衡分配。在敌人攻击的情况下，他立即将所有电力路由到所有防御机制，避免最终的过载，从而导致战斗中的防御损失降低。',
            'benefits' => '防御系统损失减半，+10% 能量生产',
        ],
        604 => [
            'name' => '地质学家',
            'description' => '地质学家是天体矿物学和晶体学方面的专家。他协助他的团队进行冶金和化学工作，同时也负责行星间通信，优化整个帝国原材料的使用和精炼。利用最先进的勘测设备，地质学家可以定位最佳的采矿区域，使采矿生产增加10%。',
            'benefits' => '+10% 矿场生产',
        ],
        605 => [
            'name' => '技术官',
            'description' => '技术官公会由天才科学家组成，您总会发现他们超越了所有人类逻辑所定义的领域。数千年来，没有普通人能够破解技术官的代码。技术官以其存在激励着帝国的研究人员。',
            'benefits' => '+2 间谍等级，研究时间减少25%',
        ],
    ],
];
